"""
Задача 9
Найти максимальный элемент среди минимальных элементов столбцов матрицы.
Коментарий: создайте матрицу 5х5, найдите минимальный элемент в каждом из стлобцов, а
потом среди минимальных вычисляем максимальный. (без max, min)

Примечание: попытайтесь решить задания без использования функций max, min, sum, sorted и их аналогов, в том числе написанных самостоятельно.
В задачах 3, 4, 5, 6, 9, если искомый элемент(ы) встречается в массиве несколько раз, используйте один любой по вашему выбору.
"""